
#Область ПрограммныйИнтерфейс

#Область Курьерика

// Дополняет массив типов документов, используемых в качестве оснований для заказов на доставку
// сервиса Курьерика.
//
// Параметры:
//	МассивТипов - Массив Из Тип - массив типов документов.
//
Процедура ПриОпределенииТиповДокументовОснованийКурьерика(МассивТипов) Экспорт
	
	МассивТипов.Добавить(Тип("ДокументСсылка.ПеремещениеТоваров"));
	МассивТипов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказНаПеремещение"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказКлиента"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ВозвратТоваровПоставщику"));
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
