#Область ПрограммныйИнтерфейс

//++ Локализация


//-- Локализация

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ОткрытьРезультатОплатыСтрокГрафика(ЭлементФормы, Результат, Оповещение) Экспорт
	
	//++ Локализация


	//-- Локализация
	
	Возврат Ложь;
	
КонецФункции

//++ Локализация

#Область РаботаСФайлами

Процедура ОткрытьФормуСпискаФайловДляПередачиВБанк(Форма) Экспорт
	
	Обработчик = Новый ОписаниеОповещения("ОткрытьФормуСпискаФайловДляПередачиВБанкЗавершение", ЭтотОбъект, Форма);
	
	Если Форма.Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
			|Переход к файлам возможен только после записи данных.
			|Данные будут записаны.'");
		ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	Иначе
		ВыполнитьОбработкуОповещения(Обработчик, КодВозвратаДиалога.Пропустить);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуСпискаФайловДляПередачиВБанкЗавершение(Ответ, Форма) Экспорт
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		Форма.Записать();
	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВладелецФайла",  Форма.Объект.Ссылка);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Форма.ТолькоПросмотр);
	
	Отбор = Новый Структура;
	Отбор.Вставить("ДляПередачиВБанк", Истина);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы",
		ПараметрыФормы,
		Форма,
		Истина,
		Форма.Окно);
	
КонецПроцедуры

#КонецОбласти


// Формирует дополнительный отбор для выбора объектов расчета.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Данные формы, в которой выполняется выбор объектов расчета.
//  ДополнительныйОтбор - Соответствие из Строка, Неопределено - дополнительный отбор
//
Процедура ДополнитьОтборОбъектовРасчета(Форма, ДополнительныйОтбор) Экспорт

	Если Форма.Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОплатаСамозанятому")
		И Форма.Объект.СписокКонтрагентов Тогда
		
		Если ДополнительныйОтбор = Неопределено Тогда
			ДополнительныйОтбор = Новый Соответствие;
		КонецЕсли;
		
		ДополнительныйОтбор.Вставить(
			"Контрагент.ЮридическоеФизическоеЛицо",
			ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо"));
		
	КонецЕсли;

КонецПроцедуры

// Установливает параметры выбора контрагента в табличной части "Расшифровка платежа".
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура УстановитьПараметрыВыбораКонтрагентаРасшифровкиПлатежа(Форма) Экспорт

	СтрокаТабличнойЧасти = Форма.Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Партнер) Тогда
		ДенежныеСредстваКлиентСерверЛокализация.УстановитьПараметрыВыбораПолучателя(
			Форма, Форма.Объект, Форма.Элементы.РасшифровкаПлатежаКонтрагент, СтрокаТабличнойЧасти.Партнер);
	Иначе
		ДенежныеСредстваКлиентСерверЛокализация.УстановитьПараметрыВыбораПолучателя(
			Форма, Форма.Объект, Форма.Элементы.РасшифровкаПлатежаКонтрагент);
	КонецЕсли;

КонецПроцедуры

//-- Локализация

#КонецОбласти