
#Область СлужебныеПроцедурыИФункции

// Сохраняет настройку отображения форм демонстрационных сценариев и глоссария
//
// Параметры:
//  ВариантОтображения  - Строка - вариант отображения формы, может принимать значения "Редактирование", "Просмотр", "Перевод"
//
Процедура СохранитьНастройкуРежимаОтображенияФормы(ВариантОтображения) Экспорт

	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("РежимОтображенияФормаОписанияПроцессов",
		                                              "НастройкиПользователя",
		                                              ВариантОтображения);
	
КонецПроцедуры

// Выполняет перевод
//
// Параметры:
//  ИсходныйТекст             - Строка - Исходный текст
//  ИсходныйЯзык              - Строка - код языка, с которого осуществляется перевод
//  ЯзыкПеревода              - Строка - язык, на который будет выполняется перевод
//
// Возвращаемое значение:
//   Структура   - См.ДемонстрационныеСценарии.РезультатПереводаНаДругиеЯзыки 
//
Функция РезультатПереводаНаДругиеЯзыки(ИсходныйТекст, ИсходныйЯзык, ЯзыкПеревода) Экспорт

	Возврат ДемонстрационныеСценарии.РезультатПереводаНаДругиеЯзыки(ИсходныйТекст, ИсходныйЯзык, ЯзыкПеревода)

КонецФункции

#КонецОбласти
